{"pageProps":{"content":{"html":"        <h1>FAQ</h1>\r\n\r\n<ul>\r\n<li><a class=\"xref\" href=\"/documentation/402636/faq/general-info\">General Info</a></li>\r\n<li><a class=\"xref\" href=\"/documentation/403937/faq/working-with-testcafe\">Working with TestCafe</a></li>\r\n</ul>\r\n","headers":[],"title":"FAQ","schema":"{\n  \"@context\": \"https://schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [{\n    \"@type\": \"Question\",\n    \"name\": \"I have heard that TestCafe does not use Selenium. How does it operate?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Unlike most testing solutions, TestCafe is not built on Selenium. This allows us to implement features you cannot find in Selenium-based tools (for example, testing on mobile devices, user roles, automatic waiting, etc.). TestCafe uses a URL-rewriting proxy which allows it to work without the WebDriver. This proxy injects the driver script that emulates user actions into the tested page. You can read about this in How it Works.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"What is the difference between TestCafe Studio and open-source TestCafe?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"TestCafe Studio is a testing IDE built on top of the open-source TestCafe engine. It simplifies the way you record tests and helps you delegate testing to a QA team that does not want to write JavaScript. Read the following article to learn how TestCafe Studio could fit into your workflow: What's Better than TestCafe? TestCafe Studio.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Has TestCafe v2015.1 been deprecated?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"TestCafe v2015.1 is no longer available for purchase or subscription renewal. We recommend that TestCafe v2015.1 users switch to TestCafe Studio to access the latest features. See this blog post for details.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Which browsers does TestCafe support? What are the exact supported versions?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"You can find a list of supported browsers in our documentation. TestCafe is tested against the two latest versions of each browser except for the browsers whose versions are specified explicitly in this list. We do not use the most recent JavaScript features in TestCafe code, which means it should work with any browser with HTML5 support released in the last three years.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Can I use third-party modules in tests?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"You can import third-party modules to the test code and inject scripts into tested webpages. To import a module to a test file, use the import statement. If a Node.js module or a JavaScript file can be executed in the browser, you can inject it into the tested page. For more information about how to inject scripts, see Inject Scripts Into Tested Pages.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"How do I work with configuration files and environment variables?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"TestCafe allows you to specify settings in a configuration file. If you need to use custom properties in the configuration, create a separate configuration file and import it to the tests.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"How do I identify elements with dynamic IDs?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"TestCafe selectors should use element identifiers that persist between test runs. However, many JavaScript frameworks generate dynamic IDs for page elements. To identify elements whose id attribute changes, use selectors based on the element's class, content, tag name, or position. See the Select Elements With Dynamic IDs example for details.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Can I use TestCafe to test React Native apps?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"You can only use TestCafe to test something that runs in a browser, including Progressive Web Applications and Electron apps. TestCafe cannot automate native mobile applications because they do not run in a browser.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"I have installed TestCafe but I cannot run it. What should I do?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"1) Check your firewall. First, make sure that your firewall does not block the ports TestCafe uses. TestCafe chooses free ports automatically by default. Use the --ports command line option or the createTestCafe API factory function to specify custom ports. After that, check that the firewall does not block these specific ports. 2) Check your proxy server. Another reason for this problem can be the proxy server you use to access the Internet. If your network is connected to the Web via a proxy, use the --proxy command line option or the useProxy API method to specify the proxy address. 3) For Linux check X11. Also note that if you run TestCafe on Linux, you need to make sure the system is running the X11 server. Without X11, you can only run tests in cloud services and headless Google Chrome. However, if you use the Xvbf server, you can run any other browser in the headless mode.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"When I run a TestCafe test, I get an unexpected error. What can cause that?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"1) JavaScript errors. The most common reason for this is a JavaScript error on the tested page. Load this page in the browser, open the console and see if the page has any errors. In case there are errors, you can either fix them or use the --skip-js-errors flag to tell TestCafe to skip them. 2) Browser extensions. If this does not help, try running the problematic test in incognito mode. You can do this by adding an appropriate flag after the browser name. If the test runs successfully, it might be browser extensions causing the issue. Try disabling them one by one and restart the test in the regular mode at each iteration. This way you can find out which extension prevents the test from running. 3) Third-party modules. In rare cases, third-party modules can be the cause. If you use a locally installed TestCafe, try installing it globally and running the test outside of the project to eliminate the influence of third-party modules.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"I have installed TestCafe plugins but they do not work. What have I done wrong?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Plugins should also be installed locally if you are using a locally installed TestCafe. If you are going to use a global TestCafe installation, or you wish to use the plugin in other projects as well, install it globally.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"My test fails because TestCafe could not find the required webpage element. Why does this happen?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"This happens because either one of the selectors you used in test code does not match any DOM element, or you used an incorrect CSS selector or a client-side function that returns no element to specify an action's target element. To determine the cause of this issue, do the following: 1) Look at the error message in the test run report to learn which selector has failed. 2) Add the t.debug() method before this selector to stop test execution before it reaches this point. 3) Run the test and wait until the browser stops at the breakpoint. Next, use the browser's development tools to ensure that elements satisfy the interaction requirements. Also, try running the test in full screen. Use the t.maximizeWindow and t.resizeWindow actions to control the browser window size. If the test passes, it means your webpage hides the target element when the window is resized to smaller dimensions. Finally, try updating TestCafe to the latest version to see if the problem persists.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"TestCafe reports that a request has failed. What are the possible reasons?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"When TestCafe does not receive a successful response from a server, it outputs the following error: \\\"Failed to load the page at https://www.example.com. Increase the value of the \\\"pageRequestTimeout\\\" variable, enable the \\\"retryTestPages\\\" option, or use quarantine\n mode to perform additional attempts to execute this test.\\\"  If you believe that this is a false negative, enable quarantine mode. The quarantine mode option forces TestCafe to repeat tests that fail until they yield conclusive results. However, we recommend that you determine the cause of this issue and address it.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"'The browser can't open the page: can't establish a secure connection to the server'\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"If your computer is connected to multiple networks (for instance, if it uses a VPN connection), TestCafe may incorrectly detect the host IP and not open the tested pages: <browsername> cannot open the page because <browsername> is unable to establish a secure connection to the server. To fix the issue, launch TestCafe with the --hostname localhost CLI option: testcafe chrome test.js --hostname localhost\"\n    }\n  }]\n}","author":null,"preview":null,"description":null,"published":null},"topicUid":"403936","headerNav":{"items":[{"name":"TestCafe Studio","id":"TestCafe Studio"},{"name":"Guides","id":"402634","url":"/documentation/402634/guides","headerUrl":"/documentation/402635/guides/overview/getting-started","items":[]},{"name":"API","id":"402632","url":"/documentation/402632/api","items":[]},{"name":"Recipes","id":"402633","url":"/documentation/402633/recipes","items":[]},{"name":"Examples","id":"402637","url":"/documentation/402637/examples"},{"name":"FAQ","id":"403936","url":"/documentation/403936/faq","headerUrl":"/documentation/402636/faq/general-info","items":[]},{"name":"What's New","id":"What's New","url":"/release-notes","href":"/release-notes","items":[]},{"name":"Dashboard Alpha","id":"Dashboard Alpha","items":[]},{"name":"Support","id":"Support","url":"/support","href":"/support"}],"activeItems":[{"name":"FAQ","id":"403936","url":"/documentation/403936/faq","headerUrl":"/documentation/402636/faq/general-info","items":[]}]},"sidebarNav":{"root":{"name":"FAQ","id":"403936","url":"/documentation/403936/faq","headerUrl":"/documentation/402636/faq/general-info"},"items":[{"name":"General","id":"402636","url":"/documentation/402636/faq/general-info"},{"name":"Working with TestCafe","id":"403937","url":"/documentation/403937/faq/working-with-testcafe"}],"activeItems":[{"name":"FAQ","id":"403936","url":"/documentation/403936/faq","headerUrl":"/documentation/402636/faq/general-info","items":[]}],"showLeafs":true},"breadcrumbsNav":[{"name":"FAQ","id":"403936","url":"/documentation/403936/faq","headerUrl":"/documentation/402636/faq/general-info","items":[]}],"publishDates":{"teamBlog":[1687305600000,1667260800000,1661904000000,1657584000000,1637107200000,1633564800000,1632268800000,1626220800000,1612828800000,1609113600000,1607644800000,1605657600000,1605571200000,1600905600000,1599091200000,1598400000000,1597968000000,1597795200000,1595980800000,1594684800000,1593475200000,1590364800000,1587340800000],"releaseNotes":[1693267200000,1692230400000,1690416000000,1687305600000,1685318400000,1683763200000,1680739200000,1678147200000,1675036800000,1672272000000,1668038400000,1661904000000,1659916800000,1658102400000,1653523200000,1642464000000,1640131200000,1633132800000,1631059200000,1625702400000,1617753600000,1616371200000,1614729600000,1613347200000,1607990400000,1596672000000,1579219200000,1574294400000,1571184000000,1568246400000,1565136000000,1562284800000,1562025600000,1551312000000,1549497600000,1549497600000,1541548800000,1540425600000,1535932800000,1533168000000,1526342400000,1519862400000,1507593600000,1506643200000,1501632000000,1497312000000,1493164800000,1490659200000,1487203200000,1484784000000,1481155200000,1478563200000,1476662400000]}},"__N_SSG":true}